MoleculeHDetector(
  (mpnn1): MPNN()
  (mpnn2): MPNN()
  (mpnn3): MPNN()
  (mpnn4): MPNN()
  (mpnn5): MPNN()
  (mpnn6): MPNN()
  (readout): AllNonZeroMaxReadout(
    (nonzero_checker): CheckAllNonZero()
  )
)